; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l21_p21_c21_g21)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 refugio20 refugio21 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 person20 person21 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 medicina)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-box box20 deposito)
	(box-has box20 medicina)
	(at-box box21 deposito)
	(box-has box21 medicina)
	(at-person person1 refugio5)
	(at-person person2 refugio20)
	(at-person person3 refugio12)
	(at-person person4 refugio11)
	(at-person person5 refugio6)
	(at-person person6 refugio5)
	(at-person person7 refugio17)
	(at-person person8 refugio15)
	(at-person person9 refugio13)
	(at-person person10 refugio10)
	(at-person person11 refugio19)
	(at-person person12 refugio1)
	(at-person person13 refugio17)
	(at-person person14 refugio18)
	(at-person person15 refugio11)
	(at-person person16 refugio6)
	(at-person person17 refugio21)
	(at-person person18 refugio10)
	(at-person person19 refugio19)
	(at-person person20 refugio11)
	(at-person person21 refugio10)
)

(:goal (and
	(person-has person1 comida)
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person3 comida)
	(person-has person4 comida)
	(person-has person4 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person7 comida)
	(person-has person9 comida)
	(person-has person10 comida)
	(person-has person10 medicina)
	(person-has person11 medicina)
	(person-has person13 medicina)
	(person-has person14 medicina)
	(person-has person17 medicina)
	(person-has person19 comida)
	(person-has person19 medicina)
	(person-has person20 medicina)
	(person-has person21 comida)
	(person-has person21 medicina)
))
)

; plan
1. (pick box10 deposito dron1-der dron1)
   deleted: (at-box box10 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box10)
   goals met: 0 of 21
2. (pick box21 deposito dron1-izq dron1)
   deleted: (at-box box21 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box21)
   goals met: 0 of 21
3. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 0 of 21
4. (move refugio20 refugio12 dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 refugio12)
   goals met: 0 of 21
5. (leave box10 refugio12 dron1-der dron1 person3 comida)
   deleted: (carrying dron1 dron1-der box10) (box-has box10 comida)
   added: (at-box box10 refugio12) (free dron1-der) (person-has person3 comida)
   goals met: 1 of 21
6. (move refugio12 deposito dron1)
   deleted: (at-dron dron1 refugio12)
   added: (at-dron dron1 deposito)
   goals met: 1 of 21
7. (pick box9 deposito dron1-der dron1)
   deleted: (at-box box9 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box9)
   goals met: 1 of 21
8. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 1 of 21
9. (move refugio20 refugio13 dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 refugio13)
   goals met: 1 of 21
10. (leave box9 refugio13 dron1-der dron1 person9 comida)
   deleted: (carrying dron1 dron1-der box9) (box-has box9 comida)
   added: (at-box box9 refugio13) (free dron1-der) (person-has person9 comida)
   goals met: 2 of 21
11. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 2 of 21
12. (pick box8 deposito dron1-der dron1)
   deleted: (at-box box8 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box8)
   goals met: 2 of 21
13. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 2 of 21
14. (move refugio20 refugio18 dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 refugio18)
   goals met: 2 of 21
15. (leave box21 refugio18 dron1-izq dron1 person14 medicina)
   deleted: (carrying dron1 dron1-izq box21) (box-has box21 medicina)
   added: (at-box box21 refugio18) (free dron1-izq) (person-has person14 medicina)
   goals met: 3 of 21
16. (move refugio18 deposito dron1)
   deleted: (at-dron dron1 refugio18)
   added: (at-dron dron1 deposito)
   goals met: 3 of 21
17. (pick box20 deposito dron1-izq dron1)
   deleted: (at-box box20 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box20)
   goals met: 3 of 21
18. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 3 of 21
19. (move refugio20 refugio21 dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 refugio21)
   goals met: 3 of 21
20. (leave box20 refugio21 dron1-izq dron1 person17 medicina)
   deleted: (carrying dron1 dron1-izq box20) (box-has box20 medicina)
   added: (at-box box20 refugio21) (free dron1-izq) (person-has person17 medicina)
   goals met: 4 of 21
21. (move refugio21 deposito dron1)
   deleted: (at-dron dron1 refugio21)
   added: (at-dron dron1 deposito)
   goals met: 4 of 21
22. (pick box19 deposito dron1-izq dron1)
   deleted: (at-box box19 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box19)
   goals met: 4 of 21
23. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 4 of 21
24. (leave box8 refugio20 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box8) (box-has box8 comida)
   added: (at-box box8 refugio20) (free dron1-der) (person-has person2 comida)
   goals met: 5 of 21
25. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 5 of 21
26. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 5 of 21
27. (move deposito refugio20 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio20)
   goals met: 5 of 21
28. (leave box19 refugio20 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box19) (box-has box19 medicina)
   added: (at-box box19 refugio20) (free dron1-izq) (person-has person2 medicina)
   goals met: 6 of 21
29. (move refugio20 deposito dron1)
   deleted: (at-dron dron1 refugio20)
   added: (at-dron dron1 deposito)
   goals met: 6 of 21
30. (pick box18 deposito dron1-izq dron1)
   deleted: (at-box box18 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box18)
   goals met: 6 of 21
31. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 6 of 21
32. (leave box7 refugio5 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 comida)
   added: (at-box box7 refugio5) (free dron1-der) (person-has person1 comida)
   goals met: 7 of 21
33. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 7 of 21
34. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 7 of 21
35. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 7 of 21
36. (leave box6 refugio5 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 comida)
   added: (at-box box6 refugio5) (free dron1-der) (person-has person6 comida)
   goals met: 8 of 21
37. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 8 of 21
38. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 8 of 21
39. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 8 of 21
40. (leave box18 refugio5 dron1-izq dron1 person6 medicina)
   deleted: (carrying dron1 dron1-izq box18) (box-has box18 medicina)
   added: (at-box box18 refugio5) (free dron1-izq) (person-has person6 medicina)
   goals met: 9 of 21
41. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 9 of 21
42. (pick box17 deposito dron1-izq dron1)
   deleted: (at-box box17 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box17)
   goals met: 9 of 21
43. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 9 of 21
44. (leave box5 refugio17 dron1-der dron1 person7 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio17) (free dron1-der) (person-has person7 comida)
   goals met: 10 of 21
45. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 10 of 21
46. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 10 of 21
47. (move deposito refugio17 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio17)
   goals met: 10 of 21
48. (leave box17 refugio17 dron1-izq dron1 person13 medicina)
   deleted: (carrying dron1 dron1-izq box17) (box-has box17 medicina)
   added: (at-box box17 refugio17) (free dron1-izq) (person-has person13 medicina)
   goals met: 11 of 21
49. (move refugio17 deposito dron1)
   deleted: (at-dron dron1 refugio17)
   added: (at-dron dron1 deposito)
   goals met: 11 of 21
50. (pick box16 deposito dron1-izq dron1)
   deleted: (at-box box16 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box16)
   goals met: 11 of 21
51. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 11 of 21
52. (leave box16 refugio19 dron1-izq dron1 person11 medicina)
   deleted: (carrying dron1 dron1-izq box16) (box-has box16 medicina)
   added: (at-box box16 refugio19) (free dron1-izq) (person-has person11 medicina)
   goals met: 12 of 21
53. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 12 of 21
54. (pick box15 deposito dron1-izq dron1)
   deleted: (at-box box15 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box15)
   goals met: 12 of 21
55. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 12 of 21
56. (leave box4 refugio19 dron1-der dron1 person19 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio19) (free dron1-der) (person-has person19 comida)
   goals met: 13 of 21
57. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 13 of 21
58. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 13 of 21
59. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 13 of 21
60. (leave box15 refugio19 dron1-izq dron1 person19 medicina)
   deleted: (carrying dron1 dron1-izq box15) (box-has box15 medicina)
   added: (at-box box15 refugio19) (free dron1-izq) (person-has person19 medicina)
   goals met: 14 of 21
61. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 14 of 21
62. (pick box14 deposito dron1-izq dron1)
   deleted: (at-box box14 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box14)
   goals met: 14 of 21
63. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 14 of 21
64. (leave box3 refugio11 dron1-der dron1 person4 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio11) (free dron1-der) (person-has person4 comida)
   goals met: 15 of 21
65. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 15 of 21
66. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 15 of 21
67. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 15 of 21
68. (leave box14 refugio11 dron1-izq dron1 person4 medicina)
   deleted: (carrying dron1 dron1-izq box14) (box-has box14 medicina)
   added: (at-box box14 refugio11) (free dron1-izq) (person-has person4 medicina)
   goals met: 16 of 21
69. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 16 of 21
70. (pick box13 deposito dron1-izq dron1)
   deleted: (at-box box13 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box13)
   goals met: 16 of 21
71. (move deposito refugio11 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio11)
   goals met: 16 of 21
72. (leave box13 refugio11 dron1-izq dron1 person20 medicina)
   deleted: (carrying dron1 dron1-izq box13) (box-has box13 medicina)
   added: (at-box box13 refugio11) (free dron1-izq) (person-has person20 medicina)
   goals met: 17 of 21
73. (move refugio11 deposito dron1)
   deleted: (at-dron dron1 refugio11)
   added: (at-dron dron1 deposito)
   goals met: 17 of 21
74. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 17 of 21
75. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 17 of 21
76. (leave box2 refugio10 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio10) (free dron1-der) (person-has person10 comida)
   goals met: 18 of 21
77. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 18 of 21
78. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 18 of 21
79. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 18 of 21
80. (leave box1 refugio10 dron1-der dron1 person21 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio10) (free dron1-der) (person-has person21 comida)
   goals met: 19 of 21
81. (leave box12 refugio10 dron1-izq dron1 person10 medicina)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 medicina)
   added: (at-box box12 refugio10) (free dron1-izq) (person-has person10 medicina)
   goals met: 20 of 21
82. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 20 of 21
83. (pick box11 deposito dron1-der dron1)
   deleted: (at-box box11 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box11)
   goals met: 20 of 21
84. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 20 of 21
85. (leave box11 refugio10 dron1-der dron1 person21 medicina)
   deleted: (carrying dron1 dron1-der box11) (box-has box11 medicina)
   added: (at-box box11 refugio10) (free dron1-der) (person-has person21 medicina)
   goals met: 21 of 21
